[
	{
		"id": 1,
		"subheading": "Favoriting ads",
		"description": "Users will be able to favorite role-play ads to easily find and revisit them later."
	},
	{
		"id": 2,
		"subheading": "Functional search within chats",
		"description": "Users will be able to search for specific messages within their chats, making it easier to find important information or revisit past conversations."
	},
	{
		"id": 3,
		"subheading": "Search chat functionality",
		"description": "Users will have the ability to search for specific chats by title from their list of conversations, allowing for quicker access to relevant chats without having to scroll through the entire inbox."
	},
	{
		"id": 4,
		"subheading": "Newer chats appearing at the top of the inbox",
		"description": "The inbox will be updated to display newer chats at the top, allowing users to easily access their most recent conversations without having to scroll through older chats."
	},
	{
		"id": 5,
		"subheading": "Message count for unread messages",
		"description": "A message count will be added to indicate the number of unread messages in each chat, helping users quickly identify which conversations require their attention."
	},
	{
		"id": 6,
		"subheading": "Read/unread indicators for messages",
		"description": "Unopened messages will be visually distinguishable from opened ones, allowing users to easily identify which messages they have already read and which ones are new."
	},
	{
		"id": 7,
		"subheading": "In browser notifications",
		"description": "Users will receive in-browser notifications for new messages/ad-replies, ensuring they stay informed about incoming communications even when they are not actively viewing the inbox."
	},
	{
		"id": 8,
		"subheading": "Adding a character limit to messages",
		"description": "To prevent excessively long messages that may cause performance issues or hinder readability, a character limit will be implemented for messages sent within the platform."
	},
	{
		"id": 9,
		"subheading": "Implementing 'create character' functionality",
		"description": "Users will be able to create and customize their own characters for role-playing scenarios, enhancing the immersive experience of the platform."
	},
	{
		"id": 10,
		"subheading": "Ad search and filtering options",
		"description": "Users will have the ability to search for role-play ads based on specific criteria such as title, user, character preferences, making it easier to find suitable role-playing opportunities."
	},
	{
		"id": 11,
		"subheading": "Ad deletion",
		"description": "Users will be able to delete their own role-play ads without it causing issues with existing chats. This will allow users to manage their ads more effectively and remove any outdated or unwanted listings."
	},
	{
		"id": 12,
		"subheading": "Block feature",
		"description": "Users will have the option to block other users, preventing them from sending messages or viewing their ads. This will enhance user safety and allow individuals to curate their interactions on the platform."
	},
	{
		"id": 13,
		"subheading": "Report feature",
		"description": "Users will be able to report inappropriate content or behavior within the platform, allowing for a safer and more enjoyable user experience. Reported content will be reviewed by the moderation team to ensure compliance with community guidelines and take appropriate action when necessary."
	},
	{
		"id": 14,
		"subheading": "Contact form functionality",
		"description": "At the moment, sending a message through the contact form doesn't actually send an email to the support team. For the time being, please contact us directly at support@taleweaver.com"
	},
	{
		"id": 15,
		"subheading": "User account deletion",
		"description": "Users will have the ability to delete their account, which will remove all of their personal information, and ads, without causing any issues."
	}
]
